Repository: quarkusio/cn.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en
Languages: zh_cn

source: Create the Quarkus AWS Lambda maven project using our Maven Archetype.
zh_cn: 使用我们的Maven Archetype创建Quarkus AWS Lambda maven项目。

source: Create the `CountResource` class with the following content:
zh_cn: 创建包含以下内容的 `CountResource` 类:

source: Create the `src/main/java/org/acme/VertxResource.java` file. It will contain our HTTP endpoints.
zh_cn: 创建 `src/main/java/org/acme/VertxResource.java` 文件。它将包含我们的HTTP端点。

source: Create the `src/main/java/org/acme/hibernate/orm/panache/FruitResource.java` file with the following content:
zh_cn: 创建 `src/main/java/org/acme/hibernate/orm/panache/FruitResource.java` 文件，内容如下：

source: Create the `src/main/java/org/acme/redis/IncrementResource.java` file, with the following content:
zh_cn: 创建 `src/main/java/org/acme/redis/IncrementResource.java` 文件，内容如下：

source: Create the `src/main/java/org/acme/redis/IncrementService.java` file, with the following content:
zh_cn: 创建 `src/main/java/org/acme/redis/IncrementService.java` 文件，内容如下：

source: Create the `src/test/java/org/acme/redis/IncrementResourceTest.java` file with the following content:
zh_cn: 创建 `src/test/java/org/acme/redis/IncrementResourceTest.java` 文件，内容如下：

source: Create the configuration
zh_cn: 创建配置

source: Create the function
zh_cn: 创建函数

source: Create the record using `Record.of(k, v)`
zh_cn: 通过 `Record.of(k, v)` 来创建记录

source: Created on
zh_cn: 创建于

source: Creating Clients Programmatically
zh_cn: 以编程方式创建Redis客户端

source: Creating JSON REST services with Quarkus is easy as it relies on proven and well known technologies.
zh_cn: 使用 Quarkus 创建 JSON REST 服务很容易，因为它依赖于经过验证且众所周知的技术。

source: Creating Your First Application
zh_cn: 创建你的第一个应用程序

source: Creating a JAX-RS endpoint
zh_cn: 创建一个JAX-RS端点

source: Creating a Linux executable without GraalVM installed
zh_cn: 在没有安装GraalVM的情况下创建一个Linux可执行文件

source: Creating a container
zh_cn: 创建一个容器

source: Creating a customized MeterRegistry
zh_cn: 创建一个自定义的MeterRegistry

source: Creating a frontend
zh_cn: 创建一个网页

source: Creating a new increment
zh_cn: 创建一个新的增量

source: Creating a scheduled job
zh_cn: 创建一个计划作业

source: Creating the Increment POJO
zh_cn: 创建Increment POJO

source: Creating the Increment Resource
zh_cn: 创建Increment资源

source: Creating the Increment Service
zh_cn: 创建Increment服务

source: Creating the Maven Deployment Project
zh_cn: 创建Maven部署项目

source: Creating the Maven Project
zh_cn: 创建Maven项目

source: Creating the Maven project
zh_cn: 创建Maven项目

source: Creating the Project
zh_cn: 创建项目

source: Creating the resource and the test
zh_cn: 创建资源和测试

source: Creating the test class
zh_cn: 创建测试类

source: Creating your first JSON REST service
zh_cn: 创建你的第一个JSON REST服务

source: Credential profiles file at the default location (`~/.aws/credentials`) shared by all AWS SDKs and the AWS CLI
zh_cn: 所有 AWS 开发工具包和 AWS CLI 共享的默认位置 （ `~.awscredentials` ）的凭证配置文件

source: Credentials Provider
zh_cn: 证书提供者

source: Credentials delivered through the Amazon ECS if the `AWS_CONTAINER_CREDENTIALS_RELATIVE_URI` environment variable is set and the security manager has permission to access the variable,
zh_cn: 如果设置了 `AWS_CONTAINER_CREDENTIALS_RELATIVE_URI` 环境变量并且安全管理员有权访问该变量，则通过 Amazon ECS 传递的凭证，

source: Cross Origin Resource Sharing
zh_cn: 跨域资源共享(CORS)

source: Cross-origin resource sharing
zh_cn: Cross-Origin 资源共享

source: Cross-site Request Forgery (CSRF) prevention
zh_cn: 防止跨站请求伪造

source: Currently, Quarkus doesn't support link:https://docs.mongodb.com/manual/core/security-client-side-encryption/[Client-Side Field Level Encryption] in native mode.
zh_cn: 目前，Quarkus在本地模式下不支持 link:https://docs.mongodb.com/manual/core/security-client-side-encryption/[客户端字段级加密] 。

source: Custom Factories
zh_cn: 定制工厂

source: Custom IDs
zh_cn: 自定义ID

source: Custom Lambda
zh_cn: 自定义Lambda

source: Custom Security Integration
zh_cn: 自定义安全集成

source: Custom `bootstrap` script
zh_cn: 自定义 `bootstrap` 脚本

source: Custom test resource
zh_cn: 自定义测试资源

source: Custom token verification
zh_cn: 自定义token验证

source: Customize Quarkus' security layer behavior.
zh_cn: 自定义Quarkus的安全层行为。

source: Customizing the underlying AMQP client
zh_cn: 定制底层AMQP客户端

source: DB2 Client
zh_cn: DB2客户端

source: DOCUMENTATION
zh_cn: 文档

source: Data
zh_cn: 数据

source: Dealing with messages
zh_cn: 处理信息

source: Dealing with the verification keys
zh_cn: 处理验证密钥

source: Debugging native executable
zh_cn: 调试原生可执行文件

source: Declarative approach
zh_cn: 声明式方法

source: Declare the bean in the _application_ scope. Spring only detects @Scheduled annotations in beans.
zh_cn: 以 _application_ scope声明该Bean。Spring只检测Bean上的@Scheduled注解。

source: Declare the root HTTP path.
zh_cn: 声明HTTP根路径。

source: Decryption Key identifier. If it is set then the decryption JWK key as well every JWT token must have a matching `kid` header.
zh_cn: 解密密钥标识符。如果它被设置，那么解密JWK密钥以及每个JWT标记必须有一个匹配的 `kid` header。

source: Decryption algorithm.
zh_cn: 解密算法。

source: Decryption key supplied as a string.
zh_cn: 以字符串形式提供的解密密钥。

source: Default
zh_cn: 默认

source: Default values
zh_cn: 默认值

source: Define a job to be executed at a fixed interval of time `fixedRate.expr` which is configurable in `application.properties`.
zh_cn: 在 `application.properties` 中定义一个以固定时间间隔执行的 `fixedRate.expr` 作业。

source: Define a job with a cron-like expression `cron.expr` which is configurable in `application.properties`.
zh_cn: 在 `application.properties` 中使用类似于cron表达式的方式定义一个名为 `cron.expr` 的作业。

source: Define a method to be executed at a fixed interval of time. The period is expressed in milliseconds.
zh_cn: 定义一个以固定时间间隔执行的方法。周期以毫秒表示。

source: Defines the default role requirements for unannotated endpoints. The role '**' is a special role that means any authenticated user. This cannot be combined with `deny-unannotated-endpoints`, as the deny will take effect instead.
zh_cn: 定义了未加注解节点的默认角色要求。角色'**'是一个特殊的角色，意味着任何认证的用户。该项不能与 `deny-unannotated-endpoints` 混合使用，因为deny会代替它生效。

source: Defining entities in external projects or jars
zh_cn: 在外部项目或jar中定义实体

source: Defining your entity
zh_cn: 定义你的实体

source: Defining your repository
zh_cn: 定义你的repository（存储库）

source: Delay class initialization
zh_cn: 推迟类的初始化

source: Delaying class initialization
zh_cn: 推迟类的初始化

source: Delete the `first` increment.
zh_cn: 删除 `first` 的增量。

source: Deleting a key
zh_cn: 删除指定的键

source: Dependency injection in Quarkus is based on ArC which is a CDI-based dependency injection solution tailored for Quarkus' architecture. If you're new to CDI then we recommend you to read the xref:cdi.adoc[Introduction to CDI] guide.
zh_cn: Quarkus中的依赖注入是基于ArC的，ArC是一个基于CDI的依赖注入解决方案，。如果你是CDI的新手，那么我们推荐你阅读 link:cdi.html[CDI简介] 指南。

source: Depending on what the final desired output of the CI/CD pipeline is, the generated binary might then be used to create a container image.
zh_cn: 根据CI/CD管道的最终期望输出，生成的二进制文件可能被用来创建一个容器镜像。

source: Deploy to AWS
zh_cn: 部署到AWS

source: Deploy to AWS Lambda Custom (native) Runtime
zh_cn: 部署到AWS Lambda Custom (native) Runtime

source: Deploy to AWS Lambda Java Runtime
zh_cn: 部署到AWS Lambda Java Runtime

source: Deploy to AWS Lambda using a Container Image
zh_cn: 使用容器镜像部署到AWS Lambda

source: Deploy your Quarkus applications on Heroku.
zh_cn: 在Heroku上部署你的Quarkus应用程序。

source: Deploying Quarkus Applications on Kubernetes
zh_cn: 在Kubernetes上部署Quarkus应用程序

source: Deploying Quarkus Applications on OpenShift
zh_cn: 在OpenShift上部署Quarkus应用程序

source: Deploying a container image lambda
zh_cn: 部署一个容器镜像lambda

source: Deploying a native executable
zh_cn: 部署一个本地可执行文件

source: Deploying to GitHub Pages
zh_cn: 部署到GitHub页面

source: Deploying to Google Cloud
zh_cn: 部署到谷歌云

source: Deploying to Heroku
zh_cn: 部署到Heroku

source: Deploying to Microsoft Azure Cloud
zh_cn: 部署到微软Azure云

source: Deploying verticles
zh_cn: 部署verticles

source: Deprecation
zh_cn: 废弃的API

source: Description
zh_cn: 描述

source: Deserialization
zh_cn: 反序列化

source: Despite the existence of the plugin, a few AMQP 1.0 features won’t work with RabbitMQ. Thus, we recommend the following configurations.
zh_cn: 尽管存在插件，但少数 AMQP 1.0 特性并不能与 RabbitMQ 一起工作。因此，我们建议采用以下配置。

source: Detailed information on the usage of `@Blocking` annotation can be found in https://smallrye.io/smallrye-reactive-messaging/smallrye-reactive-messaging/3.1/advanced/blocking.html[SmallRye Reactive Messaging – Handling blocking execution].
zh_cn: 关于 `@Blocking` 注解的详细信息，可以在 link:https://smallrye.io/smallrye-reactive-messaging/smallrye-reactive-messaging/3.1/advanced/blocking.html[SmallRye Reactive Messaging – 阻塞处理] 找到。

source: Dev Mode Differences
zh_cn: 开发模式的差异

source: Dev Services
zh_cn: 开发服务

source: Dev Services (Configuration Free Databases)
zh_cn: 开发服务（免配置数据库）。

source: Dev Services for AMQP
zh_cn: AMQP的开发服务

source: Dev Services for AMQP automatically starts an AMQP 1.0 broker in dev mode and when running tests. So, you don't have to start a broker manually. The application is configured automatically.
zh_cn: 当运行测试时，AMQP的开发服务会在开发模式下自动启动一个AMQP 1.0代理。所以，你不需要手动启动代理。应用程序会自动配置。

source: Dev Services for AMQP is automatically enabled unless:
zh_cn: AMQP的开发服务是自动启用的，除非：

source: Dev Services for AMQP relies on Docker to start the broker. If your environment does not support Docker, you will need to start the broker manually, or connect to an already running broker. You can configure the broker access using the `amqp-host`, `amqp-port`, `amqp-user` and `amqp-password` properties.
zh_cn: AMQP的开发服务依赖于Docker来启动代理。如果你的环境不支持Docker，你将需要手动启动代理，或者连接到一个已经运行的代理。你可以使用 `amqp-host` , `amqp-port` , `amqp-user` 和 `amqp-password` 属性来配置代理访问。

source: Dev Services for AMQP starts the container with the `quarkus-dev-service-amqp` label which is used to identify the container.
zh_cn: AMQP的开发服务使用 `quarkus-dev-service-amqp` 标签来启动容器，该标签用于识别容器。

source: Dev Services for AMQP uses https://quay.io/repository/artemiscloud/activemq-artemis-broker[activemq-artemis-broker] images. You can configure the image and version using the `quarkus.amqp.devservices.image-name` property:
zh_cn: AMQP的开发服务使用 https://quay.io/repository/artemiscloud/activemq-artemis-broker[activemq-artemis-broker] 镜像。你可以使用 `quarkus.amqp.devservices.image-name` 属性来配置镜像和版本:

source: Dev Services for Apicurio Registry
zh_cn: Apicurio注册表的开发服务

source: Dev Services for Apicurio Registry is automatically enabled unless:
zh_cn: Apicurio注册表的开发服务是自动启用的，除非：

source: Dev Services for Apicurio Registry relies on Docker to start the registry. If your environment does not support Docker, you will need to start the registry manually, or use an already running registry. In such case, you can configure the registry URL for all Kafka channels in SmallRye Reactive Messaging with a single property. For Apicurio Registry serde, that is:
zh_cn: Apicurio注册表的开发服务依赖于Docker来启动注册表。如果你的环境不支持Docker，你需要手动启动注册表，或者使用一个已运行的注册表。在这种情况下，你可以使用一个属性为SmallRye响应式消息中的所有Kafka通道配置注册表的URL。对于Apicurio Registry serde来说，就是：

source: Dev Services for Apicurio Registry starts the container with the `quarkus-dev-service-apicurio-registry` label which is used to identify the container.
zh_cn: Apicurio注册表的开发服务使用 `quarkus-dev-service-apicurio-registry` 标签来启动容器，该标签用于识别容器。

source: Dev Services for Apicurio Registry uses `apicurio/apicurio-registry-mem` images. You can select any 2.x version from https://hub.docker.com/r/apicurio/apicurio-registry-mem:
zh_cn: Apicurio注册表的开发服务使用 `apicurio/apicurio-registry-mem` 镜像. 你可以从 https://hub.docker.com/r/apicurio/apicurio-registry-mem 中选择任何一个2.x版本:

source: Dev Services for Kafka
zh_cn: Kafka开发服务（Dev Services）

source: Dev Services for Kafka is automatically enabled unless:
zh_cn: Kafka的开发服务是自动启用的，除非：

source: Dev Services for Kafka relies on Docker to start the broker. If your environment does not support Docker, you will need to start the broker manually, or connect to an already running broker. You can configure the broker address using `kafka.bootstrap.servers`.
zh_cn: Kafka的开发服务依赖于Docker来启动broker。如果您的环境不支持Docker，您需要手动启动broker，或者连接到一个已经运行的broker。您可以使用 `kafka.bootstrap.servers` 来配置broker地址。

source: Dev Services for Kafka starts the container with the `quarkus-dev-service-kafka` label which is used to identify the container.
zh_cn: Kafka开发服务用 `quarkus-dev-service-kafka` 标签来启动容器，该标签用于识别容器。

source: Dev Services for Kafka supports https://redpanda.com[Redpanda] and https://strimzi.io[Strimzi] (in https://github.com/apache/kafka/blob/trunk/config/kraft/README.md[Kraft] mode).
zh_cn: Kafka开发服务支持 link:https://redpanda.com[Redpanda] 和 link:https://strimzi.io[Strimzi] （在 link:https://github.com/apache/kafka/blob/trunk/config/kraft/README.md[Kraft] 模式下）。

source: Dev Services for Keycloak
zh_cn: 为Keycloak提供的开发服务

source: Dev Services for Redis
zh_cn: Redis的Dev Services

source: Dev Services for Redis relies on Docker to start the server. If your environment does not support Docker, you will need to start the server manually, or connect to an already running server.
zh_cn: Redis的Dev Services依赖Docker来启动服务器。如果你的环境不支持Docker，则需要手动启动服务，或者连接到一个运行中的服务。

source: Dev Services for Redis starts the container with the `quarkus-dev-service-redis` label which is used to identify the container.
zh_cn: Redis的Dev Services启动容器时使用 `quarkus-dev-service-redis` 标签，该标签用于识别容器。

source: Dev UI
zh_cn: 开发用户界面

source: Developer Joy
zh_cn: 开发者的乐趣

source: Developers are critical to the success of almost every organization and they need the tools to build cloud-native applications quickly and efficiently. Quarkus provides a frictionless development experience through a combination of tools, libraries, extensions, and more. Quarkus makes developers more efficient with tools to improve the inner loop development cycle while in dev mode.
zh_cn: 开发人员对几乎每个组织的成功都至关重要，他们需要工具来快速、高效地构建云原生应用程序。Quarkus通过工具、库、扩展等的组合提供了无摩擦的开发体验。Quarkus通过工具使开发人员在开发模式下更有效率地改善内循环开发周期。

source: Developing REST Services with RESTEasy Classic
zh_cn: 用RESTEasy Classic开发REST服务

source: Developing with Flyway
zh_cn: 用Flyway开发

source: Development Mode
zh_cn: 开发模式

source: Differences with vanilla JAX-RS
zh_cn: 与vanilla JAX-RS的区别

source: Disabling a policy check using a Keycloak Authorization Policy such as:
zh_cn: 使用Keycloak授权策略禁用一个策略检查，如：

source: Disabling permissions
zh_cn: 禁用权限

source: Discover how to create your first Quarkus application.
zh_cn: 了解如何创建您的第一个Quarkus应用程序。

source: Discover how to develop highly scalable REST services with JAX-RS and RESTEasy Reactive.
zh_cn: 了解如何使用JAX-RS和RESTEasy Reactive开发高度可扩展的REST服务。

source: Discover how you can streamline the release process of your Quarkus applications with JReleaser.
zh_cn: 了解如何利用JReleaser简化Quarkus应用程序的发布过程。

source: Discuss the development of Quarkus with the team in the <a href="mailto:quarkus-dev+subscribe@googlegroups.com">development mailing list </a> or by <a href="https://quarkusio.zulipchat.com/">Zulip Chat</a>.
zh_cn: 与团队讨论Quarkus开发的地方是 <a href="mailto:quarkus-dev+subscribe@googlegroups.com">开发邮件列表 </a> 或通过 <a href="https://quarkusio.zulipchat.com/">Zulip Chat</a>。

source: Discussion about Quarkus
zh_cn: 讨论Quarkus

source: Discussions and Collaboration
zh_cn: 讨论与合作

source: Distribution summaries are populated by calling the `record` method to record observed values, while timers provide additional capabilities specific to working with time and measuring durations. For example, we can use a timer to measure how long it takes to calculate prime numbers using one of the `record` methods that wraps the invocation of a Supplier function:
zh_cn: Distribution summaries是通过调用 `record` 方法来记录观测值，而timers则提供了专门用于处理时间和测量持续时间的额外功能。例如，我们可以通过如下方式使用一个timer来测量计算素数所需的时间：

source: Distroless image support is experimental.
zh_cn: 无发行版支持是试验性的。

source: Distroless images should not be used in production without rigorous testing.
zh_cn: 在没有经过严格测试的情况下，不应该在生产中使用无发行版镜像。

source: Do not change the handler switch. This must be hardcoded to `io.quarkus.amazon.lambda.runtime.QuarkusStreamHandler::handleRequest`. This handler bootstraps Quarkus and wraps your actual handler so that injection can be performed.
zh_cn: 不要改变处理程序的开关。这必须被硬编码为 `io.quarkus.amazon.lambda.runtime.QuarkusStreamHandler::handleRequest` 。这个处理程序引导Quarkus，并包装你实际的处理程序，以便可以执行注入。

source: Do not start the Keycloak server when you run the application in a dev mode - `Dev Services for Keycloak` will launch a container. See <<keycloak-dev-mode, Running the Application in Dev mode>> section below for more information.
zh_cn: 当您以开发模式运行应用程序时，请不要启动Keycloak服务器 - `Keycloak开发服务` 将启动一个容器。更多信息请参见下面在 link:#keycloak-dev-mode[开发模式下运行应用程序] 的部分。

source: Do not start the Keycloak server when you run the application in a dev mode - `Dev Services for Keycloak` will launch a container. See <<keycloak-dev-mode, Running the Application in Dev mode>> section below for more information. Make sure to put the {quickstarts-tree-url}/security-openid-connect-quickstart/config/quarkus-realm.json[realm configuration file] on the classpath (`target/classes` directory) so that it gets imported automatically when running in dev mode - unless you have already built a {quickstarts-tree-url}/security-openid-connect-quickstart[complete solution] in which case this realm file will be added to the classpath during the build.
zh_cn: 当你以开发模式运行应用程序时，不要启动Keycloak服务器 - `Keycloak开发模式` 将启动一个容器。更多信息请参见下面在 link:#keycloak-dev-mode[在keycloak开发模式下运行应用程序] 的部分。确保把{quickstarts-tree-url}/security-openid-connect-quickstart/config/quarkus-realm.json[境界配置文件]放在classpath（ `target/classes` 目录）上，以便在开发模式下运行时自动导入--除非你已经构建了{quickstarts-tree-url}/security-openid-connect-quickstart[完整解决方案]，这样的话，这个领域文件会在构建时被加入classpath。

source: Docker and Docker Compose
zh_cn: Docker和Docker Compose

source: Documentation
zh_cn: 文档

source: Documentation about the Vert.x Mutiny variant is available on https://smallrye.io/smallrye-mutiny-vertx-bindings.
zh_cn: 关于Vert.x Mutiny变体的文档可在 https://smallrye.io/smallrye-mutiny-vertx-bindings

source: Does Micrometer support annotations?
zh_cn: Micrometer支持注解吗？

source: Does it do 2 Phase Commit and slow down my app?
zh_cn: 两阶段提交是否会减慢了我的应用程序？

source: Does it work everywhere I want to?
zh_cn: 它能在我希望的所有地方工作吗？

source: Don't see and extension you need? <a href="{{site.baseurl}}/createextensions">Request a new extension</a>
zh_cn: 没有看到您需要的扩展吗? <a href="{{site.baseurl}}/createextensions">申请新的扩展</a>

source: Don't write parts of the query that you don't need: write `Person.find("order by name")` or `Person.find("name = ?1 and status = ?2", "Loïc", Status.Alive)` or even better `Person.find("name", "Loïc")`.
zh_cn: 不要写你不需要的查询部分：写 `Person.find("order by name")` 或 `Person.find("name = ?1 and status = ?2", "Loïc", Status.Alive)` ，甚至更好的 `Person.find("name", "Loïc")` 。

source: Don't write parts of the query that you don't need: write `Person.find("order by name")` or `Person.find("name = ?1 and status = ?2", "stef", Status.Alive)` or even better `Person.find("name", "stef")`.
zh_cn: 不要写多余的查询语句：可以写 `Person.find("order by name")` 或 `Person.find("name = ?1 and status = ?2", "stef", Status.Alive)` ，甚至更好的 `Person.find("name", "stef")` 。

source: Download an {quickstarts-archive-url}[archive] or clone the git repository:
zh_cn: 下载一个 {quickstarts-archive-url}[存档] 或克隆git仓库：

source: Download an {quickstarts-archive-url}[archive].
zh_cn: 下载这个 {quickstarts-archive-url}[档案] 。

source: Download the appropriate archive from <https://github.com/graalvm/mandrel/releases> or <https://github.com/graalvm/graalvm-ce-builds/releases>, and unpack it like you would any other JDK.
zh_cn: 从 <https://github.com/graalvm/mandrel/releases> 或 <https://github.com/graalvm/graalvm-ce-builds/releases> 下载相应的归档文件，然后像对待其他 JDK 一样将其解压。

source: Downloads
zh_cn: 下载地址

source: Due to the sensitive nature of security bugs, the disclosure process is more constrained than a regular bug. We appreciate you following these industry accepted guidelines, which gives time for a proper fix and limit the time window of attack.
zh_cn: 由于安全性缺陷的敏感性，披露过程比普通缺陷更受限制。我们感谢您遵循这些业界公认的指导方针，这些方针为适当的修复提供了时间，并限制了攻击的时间窗口。

source: Dumb getters and setters: since Java lacks support for properties in the language, we have to create fields, then generate getters and setters for those fields, even if they don't actually do anything more than read/write the fields.
zh_cn: 繁琐的 getters 和 setters：由于Java语言中缺乏对属性的支持，我们必须创建字段，然后为这些字段getters 和 setters，即使它们除了read/write字段外实际上没有做任何事情。

source: Duplicating ID logic: most entities need an ID, most people don't care how it's set, because it's not really relevant to your model.
zh_cn: 重复ID逻辑：大多数实体需要一个ID，大多数人并不关心它是如何设置的，因为它与你的模型并不真正相关。

source: During normal operation, a Kafka consumer preserves the order of records inside each partition assigned to it. Smallrye Reactive Messaging keeps this order for processing, unless `@Blocking(ordered = false)` is used (see <<blocking-processing>>).
zh_cn: 正常操作中，Kafka消费者会保留分配给它的每个分区里面的records的顺序。Smallrye Reactive Messaging会使用这个顺序进行处理，除非设置了 `@Blocking(ordered = false)` (参见<<blocking-processing>> )。

source: During the project creation, the `src/main/java/org/acme/GreetingResource.java` file has been created with the following content:
zh_cn: 在项目创建过程中， `src/main/java/org/acme/GreetingResource.java` 文件已被创建，其内容如下：

source: During the startup and readiness health check, the connector connects to the broker and retrieves the list of topics. This attribute specifies the maximum duration (in ms) for the retrieval. If exceeded, the channel is considered not-ready. Type: _long_
zh_cn: 在启动和就绪的健康检查期间，连接器会连接到broker并获取主题列表。这个属性指定了获取的最大耗时（ms）。如果超时，通道就被认为是没有就绪的。 类型: _long_

source: Dynamic address names
zh_cn: 动态地址名称

source: E.g. the following sample callback:
zh_cn: 例如下面的回调例子：

source: EXAMPLE APPLICATIONS
zh_cn: 示例应用

source: Each OIDC tenant can either permit or deny storing its `quarkus.oidc.TokenIntrospection` and/or `quarkus.oidc.UserInfo` data with boolean `quarkus.oidc."tenant".allow-token-introspection-cache` and `quarkus.oidc."tenant".allow-user-info-cache` properties.
zh_cn: 每个OIDC租户可以允许或拒绝存储其 `quarkus.oidc.TokenIntrospection` 和/或 `quarkus.oidc.UserInfo` 数据，其属性为布尔值 `quarkus.oidc."tenant".allow-token-introspection-cache` 和 `quarkus.oidc."tenant".allow-user-info-cache` 。

source: Each channel can be disabled via configuration using:
zh_cn: 每个 channel 都可以通过配置来禁用：

source: Easy Launch debug/dev:mode
zh_cn: 快速启动 调试/dev模式

source: Easy Quarkus-based scripting with jbang.
zh_cn: 用jbang轻松实现基于Quarkus的脚本。

source: Eclipse plugin to install into Eclipse using an update-site
zh_cn: 使用更新站点安装的Eclipse插件

source: Eclipse separate JRE definition
zh_cn: Eclipse中独立的JRE定义

source: Ecosystem
zh_cn: 生态系统

source: Edit the `GreetingResource` class to inject the `GreetingService` and create a new endpoint using it:
zh_cn: 编辑 `GreetingResource` 类，注入 `GreetingService` ，并使用它创建一个新的端点:

source: Edit the `application.properties` file and add the `cron.expr` and the `fixedRate.expr` configuration:
zh_cn: 编辑 `application.properties` 文件，添加 `cron.expr` 和 `fixedRate.expr` 配置:

source: Either of these commands will compile and create a native executable image. It also generates a zip file `target/function.zip`. This zip file contains your native executable image renamed to `bootstrap`. This is a requirement of the AWS Lambda Custom (Provided) Runtime.
zh_cn: 这两个命令中的任何一个都会编译并创建一个本地可执行镜像。它还会生成一个zip文件 `target/function.zip` 。这个zip文件包含已重命名为 `bootstrap` 的本地可执行镜像，。这是AWS Lambda Custom (Provided) Runtime的要求。

source: Email used to subscribe to our mailing list.
zh_cn: 用于订阅我们邮件列表的电子邮件。

source: Enable the appropriate <<native-transport>> and set the following environment property:
zh_cn: 启用适当的 link:#native-transport[[native-transport]] 并设置以下环境属性：

source: Enabled with `mp.messaging.outgoing.$channel.propagate-record-key=true` configuration, record key propagation produces the outgoing record with the same _key_ as the incoming record.
zh_cn: 通过启用 `mp.messaging.outgoing.$channel.propagate-record-key=true` ，记录键传播可以产生与传入记录的 _键_ 相同的传出记录。
